In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
gdp_df = pd.read_csv('../data/gdp_percapita.csv')

In [4]:
gdp_df.head()

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2018  1734.723214              NaN
1     Afghanistan  2017  1758.465636              NaN
2     Afghanistan  2016  1757.023490              NaN
3     Afghanistan  2015  1766.593077              NaN
4     Afghanistan  2014  1795.735834              NaN

In [6]:
internet_df = pd.read_csv('../data/internet_use.csv')

In [7]:
internet_df.head()

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN

In [8]:
internet_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4677 entries, 0 to 4676
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  4676 non-null   object
 1   Year             4676 non-null   object
 2   Value            4495 non-null   float64
 3   Value Footnotes  948 non-null    float64
dtypes: float64(2), object(2)
memory usage: 146.3+ KB

In [9]:
gdp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6731 entries, 0 to 6730
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  6731 non-null   object
 1   Year             6731 non-null   object
 2   Value            6729 non-null   float64
 3   Value Footnotes  1 non-null      float64
dtypes: float64(2), object(2)
memory usage: 210.5+ KB

In [12]:
gdp_df[-10:]

,Country or Area,Year,Value,Value Footnotes
6721,Zimbabwe,1997,3036.422224,NaN
6722,Zimbabwe,1996,2985.856605,NaN
6723,Zimbabwe,1995,2736.486436,NaN
6724,Zimbabwe,1994,2768.309953,NaN
6725,Zimbabwe,1993,2572.870395,NaN
6726,Zimbabwe,1992,2591.007534,NaN
6727,Zimbabwe,1991,2906.272849,NaN
6728,Zimbabwe,1990,2819.549467,NaN
6729,footnoteSeqID,Footnote,NaN,NaN
6730,2,"Excludes South Sudan after July 9, 2011.",NaN,NaN

In [14]:
internet_df[-10:]

,Country or Area,Year,Value,Value Footnotes
4667,171,Internet Dial-up customers.,NaN,NaN
4668,172,Population age 16+ using the Internet in the l...,NaN,NaN
4669,173,Population age 16+ using internet in the last ...,NaN,NaN
4670,174,"U.S. Census Bureau, Table 2. Reported Internet...",NaN,NaN
4671,175,Includes individuals 3 years and older,NaN,NaN
4672,176,NTIA/CPS survey.,NaN,NaN
4673,177,"Pew Internet Project, Internet. Broadband and...",NaN,NaN
4674,178,Estimated based on Survey's results. Populatio...,NaN,NaN
4675,179,Preliminary. Country estimate.,NaN,NaN
4676,180,The methodology used to estimated the figure f...,NaN,NaN

In [23]:
internet_df = internet_df.drop('Value Footnotes',1)

In [24]:
gdp_df = gdp_df.drop('Value Footnotes',1)

In [27]:
gdp_df = gdp_df.rename(columns={'Country or Area':'Country','Value':'GDP_Per_Capita'})

In [29]:
internet_df = internet_df.rename(columns={'Country or Area':'Country','Value':'Internet_Users_Pct'})

In [30]:
gdp_and_internet_use = gdp_df.merge(internet_df)

In [31]:
gdp_and_internet_use.head()

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
0  Afghanistan  2014     1795.735834            6.390000
1  Afghanistan  2013     1807.762344            5.900000
2  Afghanistan  2012     1772.764974            5.454545
3  Afghanistan  2011     1626.764793            5.000000
4  Afghanistan  2010     1671.581238            4.000000